app/controllers/gumtree_controller.rb

  def index
    @watchers = GumtreeWatcher.all
---
SELECT "gumtree_watchers".* FROM "gumtree_watchers"

  def remove_watcher
    id = params[:id]
    return unless id

    GumtreeWatcher.find(id).delete
---
DELETE FROM "gumtree_watchers" WHERE "gumtree_watchers"."id" = $1  [["id", 5]]
SELECT  "gumtree_watchers".* FROM "gumtree_watchers" WHERE "gumtree_watchers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def save_watcher
    name = params[:name]
    return unless name

    name.downcase!
    unless GumtreeWatcher.find_by_name(name)
      watcher = GumtreeWatcher.create(name: name)
---
SELECT  "gumtree_watchers".* FROM "gumtree_watchers" WHERE "gumtree_watchers"."name" = $1 LIMIT $2  [["name", "DVD"], ["LIMIT", 1]]
INSERT INTO "gumtree_watchers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "123"], ["created_at", "2017-07-08 10:47:49.605088"], ["updated_at", "2017-07-08 10:47:49.605088"]]